package main.lesson12;

// Напишите программу для вывода нечетных чисел от 1 до 20
public class task_02 {
  public static void main(String[] args) {
    for (int i = 1; i <= 20; i += 2) {
      System.out.println(i);
    }
  }
}
